#==============================================================================
# ■ Window_Base
#------------------------------------------------------------------------------
# 　ゲーム中の全てのウィンドウのスーパークラスです。
#==============================================================================

class Window_Base < Window
  #--------------------------------------------------------------------------
  # 〇 性別の描画
  #--------------------------------------------------------------------------
  def draw_actor_sex(actor, x, y, width = 112)
    if actor.woman?
      change_color(hp_gauge_color1)
    else
      change_color(text_color(1))
    end
    draw_text(x, y, width, line_height, actor.sex_name)
  end
end
