module Quest
  
  MAIN = Hash[
               "OP-01" => ["序章", "00", 
"魔法王国サジタリーズに仕える
宮廷魔術師のLunariaは
同僚のShirley、Estiaと共に
魔物が異常発生したという遺跡の調査へ
向かう準備をしていた。"],
               
               "OP-02" => ["序章", "00", 
"宮廷魔術師の先輩であるLiliの指示の下
遺跡へ転移したLunaria達。
遺跡を探索していると最下層で
魔物の発生源である魔法陣を発見する。

皆で魔法陣を無力化した次の瞬間
新たな魔法陣が発動し、Lunaria達は謎の男に
魔力を奪われ、意識を失ってしまう。

団長のMillayに救出され、次に目が覚めた時
そこは城のベッドの上だった。
そこでLunariaは、Marianaから告げられる。

奪われた魔力は、もう元には
戻らないかもしれないと…"], # 最大１５行 ２３文字
               
               "OP-03" => ["序章", "00", 
"古の魔神を討伐した際に用いられた
５つの宝玉の力を借りれば皆の失われた魔力を
元に戻せるかもしれないと話すMariana。

それを聞いた女王Dianaは
Lunariaに５つの宝玉を集めるように命じる。
最初に目指すのは\eimpサジタリーズの南\ec[0]に位置する
森の奥にある遺跡。

Marianaから、失った魔力を補う術として
\eimpサキュバスの秘術\ec[0]と呼ばれる力を
受け取り、城を後にするLunaria。

―こうしてLunariaの宝玉集めの旅が始まった―"],
               
               "01-01" => ["第一章", "01", 
"サジタリーズの城下町の南に位置するリゼルの森。

一つ目の宝玉は
その\eimp森の最奥の遺跡\ec[0]にあるという。
Lunariaは宝玉を求め森の奥を目指す。"],

               "01-02" => ["第一章", "01", 
"リゼルの森の途中にある村 ロべで一晩休息を
取ったLunariaは、村に滞在する宮廷魔術師の
仲間から南の森には強力な魔物が
住み着いているかもしれないという情報を得る。

森の奥の遺跡手前にいたアーマードホーンを
倒したLunariaは遺跡へと向かったが、
遺跡の扉には何かの仕掛けが施してあり
簡単に中に入れそうになかった。

魔導通信機でMarianaに連絡を取ると\eimpそういう時は
近くの村や町で情報を集めるといい\ec[0]と言われる。

Lunariaは遺跡について何か知っていないか
\eimpロべの村長\ec[0]を訪ねる事にした。
"],

               "01-03" => ["第一章", "01", 
"ロべの村長から遺跡へ入るための石板を受け取り
無事 遺跡の扉を開ける事に成功する。

魔物の巣喰う遺跡内部を進み遂に一つ目の宝玉を
手に入れたLunaria。その時ちょうどMarianaから
連絡が入り次の宝玉がフリゼニア神殿と
九条迷宮にある事を教えられる。

どちらも\eimp城下町から南西にあるグレア洞窟\ec[0]を
抜ける必要がある為、Lunariaは一先ず
洞窟を抜けた先の\eimpラグラス\ec[0]という町を目指す事に。

しかし、宝玉を黒衣の男が狙っている事を
Lunariaはまだ知らずにいた…
"],

               "02-01" => ["第二章", "02", 
"グレア洞窟を抜けラグラスに到着したLunaria。

次の目的地であるフリゼニア神殿と九条迷宮の
あるティモル山とトキワについての情報を得る為
\eimp酒場で情報を集める\ec[0]事に。
"],

               "02-02" => ["第二章", "02", 
"ティモル山では崖崩れが起き、トキワへの船は
運航中止という事でラグラスで足止めを喰らう
Lunaria。そんな時、夫を探す\eimpSonia\ec[0]と名乗る
人妻戦士と出会う。

彼女が町の\eimp南の洞窟\ec[0]をねぐらにしている盗賊を
退治しに向かったというので、彼女の事が
気になったLunariaは後を追う。

洞窟前でSoniaと合流し、二人は協力して
\eimp盗賊退治\ec[0]をする事になった。
"],

               "02-03" => ["第二章", "02", 
"洞窟の奥で隠し通路を発見すると、その先には
盗賊達のアジトがあった。

二人はアジトに乗り込み、盗賊の一味を退治して
捕まっていた女性達を助ける事に成功する。
Soniaは助けた女性達に
夫の事について聞くが収穫は無かった…

盗賊との戦いで疲れた二人は
一旦\eimpラグラスへ戻り宿で一休み\ec[0]する事に。
"],

               "02-04" => ["第二章", "02", 
"町へ戻り一休みした翌日、ティモル山の土砂が
撤去され山道の封鎖が解かれた事を知る。

Soniaはティモル山を越えた先のダリア地方で
夫の捜索を続けるというので、二人は
\eimpティモル山\ec[0]の途中まで一緒に行く事にした。
"],

               "02-05" => ["第二章", "02", 
"山の中腹の分かれ道でSoniaと別れる事に。

Soniaが行方不明の夫と無事に再会出来る事を
願いながら、Lunariaは\eimp山頂の
フリゼニア神殿\ec[0]を目指す。

彼女とは、また近いうちに会えるような
そんな不思議な予感がした。
"],

               "03-01" => ["第三章", "03", 
"ティモル山の山頂付近は雪が吹きすさんでいた。

吹雪の中を山頂目指して進んでいくと
目的地であるフリゼニア神殿へと到着する。

内部にはどうやら自分以外にも
冒険者が数名いるようだ。

他の者に宝玉を取られてしまわないよう
Lunariaは急ぎ\eimp神殿の最上階\ec[0]を目指す。
"],

               "03-02" => ["第三章", "03", 
"フリゼニア神殿を攻略し、最上階にて
守護者を倒し二つ目の宝玉を手に入れる事に
成功したLunaria。

現在判明している\eimp三つ目の宝玉のあるトキワ\ec[0]へ
渡る為、\eimpラグラスから東にある港町の
セネシオを目指す\ec[0]事に。
"],

               "03-03" => ["第三章", "03", 
"港町セネシオでは未だトキワ行きの定期船が
運航休止のままだった。

途方に暮れるLunariaにトキワ出身の\eimpMana\ec[0]と
名乗る少女が声をかけてくる。
Manaは、自分に協力する事を約束するなら
特別な方法でトキワへ連れて行ってくれるという。

他にトキワへ渡る方法がない事もあり、
Lunariaは\eimpManaに協力\ec[0]する事を約束し
\eimpトキワへ連れて行ってもらう\ec[0]事となった。
"],

               "03-04" => ["第三章", "03", 
"移送方陣でトキワ近くの小島へ転移した二人は
地下道を進みトキワを目指す。

トキワでは\eimp邪龍\ec[0]と呼ばれる妖怪の封印が
解けかかっており、これの再封印に
協力して欲しいという。

邪龍の封印が弱まった影響でトキワの妖怪達が
狂暴化しているという話を聞いたLunariaは
大陸の魔物が狂暴化している原因もそれが
関係しているのではと疑う。
しかしManaはそれを否定する。
――むしろ、大陸の方で起きている何かが原因で
邪龍の封印が弱まっているのではないか――
と、Manaはそう考えるのだった…
"],

               "04-01" => ["第四章", "04", 
"地下道を抜け少し進むとすぐに集落が見えた。

そこは巫女達が住む
\eimp常盤国 九条の里\ec[0] と呼ばれる所だった。

Manaの話によると一番奥の屋敷に
この里の長がいると言うのでまずは里の長に
挨拶する為\eimp一番奥の大きな屋敷\ec[0]を目指す事に。
"],

               "04-02" => ["第四章", "04", 
"屋敷の奥間にて里長のTsukihaと面会するLunaria。

Tsukihaは、邪龍の再封印に協力すれば
宝玉の封印されているという九条迷宮への
立ち入りを許可してくれると約束してくれた。

Tsukihaへの面会を済ませたLunariaは
邪龍再封印の為、\eimpManaと共に里の北にある
封印の洞窟\ec[0]を目指すのだった。
"],

               "04-03" => ["第四章", "04", 
"封印の洞窟の途中でヤマコと呼ばれる妖怪と
遭遇する二人。ヤマコは里の巫女達を攫い
監禁して孕むまで犯すのだという。

なんとか二体のヤマコを退治した二人は
監禁されていた巫女達を救出し、再び\eimp洞窟の
最奥\ec[0]を目指す。
"],

               "04-04" => ["第四章", "04", 
"洞窟の奥地、封印の地で邪龍の影を倒し
再封印に成功したLunariaとMana。

Lunariaは約束通り\eimp九条迷宮\ec[0]への立ち入りを
許可して貰える事となった。

九条迷宮へは\eimp里から南の川を渡り、更に南下した
先の港町サカイから船で渡る\ec[0]のだという。

名残を惜しみつつManaに別れを告げた
Lunariaは、一人宝玉を求め南へ旅立つのだった。
"],

               "04-05" => ["第四章", "04", 
"サカイから九条迷宮のある孤島へと渡った
Lunaria。九条迷宮内部は複雑に入り組み、
多くの仕掛けが施されていた。

全ての仕掛けを解き、最深部で守護者を倒した
Lunariaは三つ目の宝玉を手に入れる事に
成功する。そこへMarianaから連絡が入り
残り二つの宝玉がサジタリーズの隣国である
ダリア王国方面に封印されている事が判明する。

ダリアとの関所を通過する為の\eimp通行手形\ec[0]を貰うため
Lunariaは一路\eimpサジタリーズへ戻る\ec[0]事となった。
"],

               "05-01" => ["第五章", "05", 
"久しぶりにサジタリーズへと戻ってきたLunaria。

Marianaから通行手形を貰うため、
城内にある\eimpMarianaの研究室\ec[0]を目指す。
"],

               "05-02" => ["第五章", "05", 
"研究室でMariana、Diana、Millayと会い
\eimp通行手形\ec[0]とダリアの女王Filicaへ宛てた\eimp手紙\ec[0]を
受け取ったLunaria。

残り２つの宝玉はダリア王都カクタスより北西の
\eimpフォリア遺跡\ec[0]とダリア王国東のレオンタイス砂漠を
越えた先にある\eimp万魔の塔\ec[0]に封印されているという。

ダリア王国を目指し、Lunariaは\eimpティモル山を
西に抜けた先\ec[0]にある二国間の\eimp関所\ec[0]へと向かった。
"],

               "05-03" => ["第五章", "05", 
"ティモル山を西に抜け北上すると国境の
関所が見えた。関所のダリア王国側の兵士に
通行手形を見せると問題なく通行を許可される。

兵士の話では関所を出て\eimp道なりに北\ec[0]へ行くと
\eimpハイドラ湿原\ec[0]があり、そこを越えると
\eimp王都カクタス\ec[0]に着くという。

関所から湿原へ行く途中に\eimpネメシア\ec[0]と呼ばれる
町があるが、どうやら\eimpあまり治安は良くない\ec[0]らしい。

補給等でどうしてもという場合以外は
立ち寄らない方が賢明だろう。
"],

#----------------------------------------------Aルート

               "05-04" => ["第五章", "05", 
"無法街ネメシアでスリにあい、Dianaから
預かった大切な手紙を盗まれてしまったLunaria。
手紙を取り返すべく男の家へ行くと、手紙を返す
代わりに身体を要求される。

男に犯されたLunariaは手紙を手に家を
飛び出すが、その直後 男の前に
煽情的な格好をした女の魔物が姿を表す。

\eimp同族の匂い\ec[0]につられて来たという魔物は
男の魂を刈り取り、愉快そうに笑う。

――\eimp淫魔の女王の復活\ec[0]――
その言葉を残し、魔物は闇へと消えていった…
"],

               "05-05" => ["第五章", "05", 
"雨の降る湿原を抜けるとすぐ先には王都が見えた。
サジタリーズよりも大きな城下に
圧倒されつつも、まずは砂漠への\eimp許可証を
発行してくれる場所\ec[0]を探す事に。
"],

               "05-06" => ["第五章", "05", 
"王都へ入ってすぐの役所で許可証の申請を
したLunaria。許可証の発行には少し時間が
かかるというのでその間にフォリア遺跡を
探索する事に。

フォリア遺跡は\eimp王都から北西に進んだ場所\ec[0]にある。
準備が出来たら出発しよう。
"],


#-----------------------------------------------

               "06-01" => ["第六章", "06", 
"山間の村ビオーサを抜けると森の奥に
フォリア遺跡があった。

見た所、他の冒険者などは見当たらないようだが
特に許可なく入れる遺跡の為 うかうかしていると
誰かに宝玉を取られてしまうかもしれない。

なるべく急いで宝玉の間へと急ごう。
"],

#-----------------------------------------------TRUE

               "06-02" => ["第六章", "06", 
"Lunariaがフォリア遺跡へ入るとその後を追う
怪しい影が二つ…

一人はLunaria達の魔力を奪ったローブの男…
そしてもう一人は謎の淫魔…

利害の一致した二人は手を組み、暗躍を始める。

だがその事をまだLunariaは
知る由もなかった…
"],

               "06-03a" => ["第六章", "06", 
"遺跡の最深部で守護者を倒し４つ目の宝玉を
手に入れる事に成功したLunaria。

残る宝玉はあと一つ…レオンタイス砂漠を
越えた先にある万魔の塔に封印されている。

遺跡へ行く前に申請していた砂漠へ入る為の
許可証がそろそろ発行されている頃だ。

王都カクタスへ戻り、\eimp役所で許可証を受け取ろう\ec[0]。
"],

#-----------------------------------------------NORMAL

               "06-03b" => ["第六章", "06", 
"フォリア遺跡の最深部へ入ると、既に守護者は
倒されており宝玉も見当たらなかった。

魔力の残滓を調べてみると、戦いがあってから
まだそんなに時間は経っていないようだった。

Lunariaは自分以外の冒険者が遺跡に
行っていないか\eimpビオーサで聞き込み\ec[0]を
する事にした。
"],

               "06-04-1" => ["第六章", "06", 
"ビオーサで聞き込みをすると宝玉を持ってると
思われる女冒険者が王都で宝玉を売って
お金にすると言っていたらしい。

カクタスの冒険者ギルドでその事を聞き込むと
その女冒険者と出会う事が出来た。しかし
宝玉は既に彼女の手元にはなく富豪に売った
後だった。
Lunariaは富豪に直接交渉する為
\eimp富裕区の北東\ec[0]にある\eimp\ekpt[22]\ec[0]という人物の
屋敷を訪ねる事に…
"],

               "06-04-2" => ["第六章", "06", 
"富豪\ekpt[22]の屋敷へ赴き宝玉を
譲ってもらえないかお願いすると、知り合いを
呼んで\eimp自分と３Ｐ\ec[0]をしてくれれば譲るという
驚きの提案をされる。

その提案を承諾してくれそうな知り合い…
Lunariaは真っ先に\ekp[1]の事を思い浮かべ
Marianaへ事情を説明する為、
\eimpサジタリーズ城\ec[0]へと戻るのだった…
"],

#-----------------------------------------------BAD
               "06-05a" => ["第六章", "06", 
"Marianaに事情を説明して協力してもらい
無事に富豪から光の宝玉を譲り受けたLunaria。

快楽に耽る昨夜の自分に戸惑いながらも
使命を忘れる事なく、次なる目的の為
\eimp許可証\ec[0]を受け取りに\eimp役所\ec[0]へ向かう事に。

そのLunariaを、ネメシアに現れた
謎の淫魔が怪しい瞳で見つめていた…

今回の事は全て、彼女が仕組んだ事
だったのだ。
"],
#-----------------------------------------------

               "06-05b" => ["第六章", "06", 
"Marianaに事情を説明して協力してもらい
無事に富豪から光の宝玉を譲り受けたLunaria。

快楽に耽る昨夜の自分に戸惑いながらも
使命を忘れる事なく、次なる目的の為
\eimp許可証\ec[0]を受け取りに\eimp役所\ec[0]へ向かう事に。
"],

               "06-06" => ["第六章", "06", 
"役所にて許可証を受け取った時に確認すると
万魔の塔へ入る為にはダリアの女王の
許可が必要だと教えられた。

Lunariaは女王へ謁見し協力を仰ぐ為
\eimp王都の階段を上がった先\ec[0]にある
\eimpダリアの王城\ec[0]へと赴くことにした。
"],

               "07-01" => ["第七章", "07", 
"役所にて許可証を受け取った時に確認すると
万魔の塔へ入る為にはダリアの女王の
許可が必要だと教えられた。

役所を出ると折よく女王が遠征から帰還した
所だった。Lunariaは女王へ謁見し協力を仰ぐ為
\eimp王都の階段を上がった先\ec[0]にある
\eimpダリアの王城\ec[0]へと赴くことにした。
"],

               "07-02" => ["第七章", "07", 
"ダリアの女王Filicaに謁見し、Dianaから
預かった手紙を見せると、何故か私室へと
案内された。そこで事情を聴いたFilicaは
万魔の塔へ入るのを許可する代わりに
\eimpネメシアにあるZepar教\ec[0]という教団を
調査して欲しいとLunariaにお願いしてくる。

なんでも、教団は裏でいかがわしい事をしている
らしく、その証拠を掴んで欲しいというのだ。
少し前\eimpSonia\ec[0]が調査に向かったらしいが
一切の\eimp連絡がない\ec[0]というので心配になった
Lunariaは調査を引き受ける事にした。
"],

               "07-03" => ["第七章", "07", 
"ネメシアで情報を集めるとSoniaが
Zepar教に入信したという話を耳にする。
確かめる為Zepar教本部へ行ったLunariaは
その場でSoniaと再会する。しかし彼女の様子が
おかしい事に気付いたLunariaは教祖の男の勧誘を
断り一旦引き返す事に。

なんとか本部内に忍び込めないか考えていた所
本部の建築に関わったという大工の男に出会う。

その男が言うにはハイドラ湿原の入口辺りにある
地下水路への入口と、教団本部内の教祖の部屋は
繋がっているのだという。
Lunariaは急ぎ\eimpハイドラ湿原\ec[0]へ行き、
\eimp地下水路への入口\ec[0]を探す事にした。
"],

               "07-04" => ["第七章", "07", 
"男の言う通り、ハイドラ湿原の入口の石像の
下には地下水路への入口があり、水路の先は
教団本部内の教祖の部屋へと繋がっていた。

地下水路から上手く教団内に潜入したLunariaは、
何かいかがわしい事をしているという証拠を
掴む為、教祖の部屋を捜索する事に。
"],

               "07-05a" => ["第七章", "07", 
"教祖の部屋には魔映水晶と呼ばれる映像記録用の
水晶があり、そこに全てが記録されていた。
Soniaは\eimp洗脳\ec[0]により言い成りにされていたのだ。
その水晶を証拠として回収し、脱出しようと
した所を教祖とSoniaに見つかってしまう。

しかしなんとか二人を退けたLunariaは
この事をFilicaに報告。Zepar教は
解体される事となった。
"],

               "07-05b" => ["第七章", "07", 
"教祖の部屋には魔映水晶と呼ばれる映像記録用の
水晶があり、そこに全てが記録されていた。
Soniaは\eimp洗脳\ec[0]により言い成りにされていたのだ。
その水晶を証拠として回収し、脱出しようと
した所を教祖とSoniaに見つかってしまう。

Soniaを相手に苦戦を強いられたLunariaは
\eimp自らも教祖の洗脳の術に陥落\ec[0]してしまう。
そうしてSoniaとLunariaを洗脳下においた
教祖\esbt[2]は二人を相手に\eimp快楽の宴\ec[0]を
始めるのだった…
"],

               "07-06a" => ["第七章", "07", 
"二人を相手にたっぷり楽しんだ\esbt[2]の前に
Lunariaをネメシア到着からずっと尾けていた
淫魔が姿を現す。二人は顔見知りのようで
\eimpRenno\ec[0]と呼ばれたその淫魔は\esbt[2]の事を
\eimpZepar\ec[0]と呼んでいた。

Lunariaを\eimp淫魔の女王の器\ec[0]にしようというRennoと
自分の所有物として
傍においておきたいZepar…

二人の意見が交わる事はなく、そして遂にRennoは
強硬手段に出る。\eimpZeparの魂はRennoの能力に
よって刈り取られ、跡形もなく消滅\ec[0]してしまった…
"],

               "07-06b" => ["第七章", "07", 
"二人を相手にたっぷり楽しんだ\esbt[2]の前に
何者かが姿を現し、そして―――
"],

               "07-07" => ["第七章", "07", 
"教祖との情事のあと、目覚めたLunariaの
洗脳は解けていた。部屋には教祖の男が
倒れており、何者かに倒されたとみられる。

共に洗脳の解けたSoniaを介抱し、
Lunariaは事の顛末をFilicaに報告。
魔映水晶が証拠となり教祖の数々の悪事は
露見、Zepar教は解体される事となった。
"],

               "07-08a" => ["第七章", "07", 
"Zepar教調査のお礼としてLunariaは
万魔の塔と北の廃坑の探索をFilicaから
許可される。

王都に残るというSoniaに別れを告げ
Lunariaは最後の宝玉の眠る場所である
\eimp万魔の塔\ec[0]を目指し、\eimpレオンタイス砂漠\ec[0]へ
足を踏み入れるのだった。
"],

               "07-08b" => ["第七章", "07", 
"Zepar教調査のお礼としてLunariaは
万魔の塔と北の廃坑の探索をFilicaから
許可される。

王都に残るというSoniaに別れを告げ
Lunariaは最後の宝玉の眠る場所である
\eimp万魔の塔\ec[0]を目指し、\eimpレオンタイス砂漠\ec[0]へ
足を踏み入れるのだった。

――その裏で何者かが暗躍している事を
Lunariaは知る由もない…
"],

               "07-08c" => ["第七章", "07", 
"Zepar教調査のお礼としてLunariaは
万魔の塔と北の廃坑の探索をFilicaから
許可される。

王都に残るというSoniaに別れを告げ
Lunariaは最後の宝玉の眠る場所である
\eimp万魔の塔\ec[0]を目指し、\eimpレオンタイス砂漠\ec[0]へ
足を踏み入れるのだった。

しかし、Lunariaには気掛かりな事があった。
教祖の部屋で気絶している時に聞いた
\eimp「北の廃坑で待ってる」\ec[0]という言葉…
それは一体誰の言葉なのだろうか…
\eimp塔へ行く前\ec[0]に\eimp廃坑を探索\ec[0]してみるのも
悪くないかもしれない…
"],

               "08-01" => ["第八章", "08", 
"レオンタイス砂漠は砂塵の吹き荒ぶ
広大なエリアだった。強力な魔物も多く
生息しており、非常に危険な場所だという。

しかしながら道中にオアシスがあるらしいので
そこで休憩をとりつつ、砂漠を抜ける事にした。
"],

               "08-02a" => ["第八章", "08", 
"なんとか砂漠を抜けた先には万魔の塔が高く
聳え立っていた。

入口の兵士に話は通っていたようで、話しかけると
すぐに道を開けてくれた。

この塔の\eimp最上階に最後の宝玉\ec[0]が封印されている…
Lunariaは気を引き締め、最上階を目指し
万魔の塔を登り始めるのだった。
"],

               "08-02b" => ["第八章", "08", 
"なんとか砂漠を抜けた先には万魔の塔が高く
聳え立っていた。

入口の兵士に話は通っていたようで、話しかけると
すぐに道を開けてくれた。

この塔の\eimp最上階に最後の宝玉\ec[0]が封印されている…
Lunariaは気を引き締め、最上階を目指し
万魔の塔を登り始めるのだった。

――その頃、時を同じくして
万魔の塔に忍び寄る影があった…
そして魔の手は、塔だけではなく
故郷の\eimpサジタリーズ\ec[0]にも……
"],

               "08-03a" => ["第八章", "08", 
"最上階にて守護者を倒し、無事最後の宝玉を
手に入れたLunaria。その事をMarianaに
報告すると、向こうでも魔力源を回復させる
魔法陣が完成したとの事。その事に喜び、急いで
サジタリーズへ戻ろうとするLunariaの前に
今回の事件の元凶である黒いローブの男が現れる。

男はLunariaの集めた宝玉を奪おうと襲い掛かるが
なんとかこれを撃退。男を気絶させるとその場に
Millayが現れる。Millayは男の行動を事前に
予測し、Lunariaの事を心配して駆けつけたのだ。

Lunariaの無事に安堵したMillayは男を連れ
一足先にサジタリーズへ戻る。その後を追い
Lunariaも\eimpサジタリーズへ戻る\ec[0]のだった。
"],

               "08-03b" => ["第八章", "08", 
"最上階にて守護者を倒し、無事最後の宝玉を
手に入れたLunaria。その事をMarianaに
報告しようとするが魔導通信機が繋がらない…
心配するLunariaの前に今回の事件の
元凶である黒いローブの男が現れる。

男はLunariaの集めた宝玉を奪おうと襲い掛かるが
なんとかこれを撃退。敗れた男はあっさりと
その場を撤退した…

その事に違和感を覚えたLunariaは
妙な胸騒ぎを覚え、大急ぎで
\eimpサジタリーズへ戻る\ec[0]のだった。
"],

               "09-01a" => ["最終章", "09", 
"無事５つの宝玉を集めサジタリーズへと
戻ってきたLunaria。

任務完了の報告を女王陛下にする為、
\eimpお城の謁見の間\ec[0]へと急いだ
"],

               "09-02a" => ["最終章", "09", 
"謁見の間で報告を済ませるとすぐに
魔力再生の儀を執り行う準備が始められた。

魔力再生の儀はお城の\eimp地下研究室の奥\ec[0]にある
\eimp訓練場\ec[0]で行われる。

\eimp長かった旅もこれでようやく終わりを迎える。
悔いの無いように準備をして
地下の訓練場へ向かおう。\ec[0]
"],

               "09-01b" => ["第九章", "09", 
"急いでサジタリーズへ戻ったLunariaの目の前に
広がっていたもの…それは魔物達に
襲撃を受けている城下町の姿だった。

一体何が起こっているのかは分からないが、まずは
魔物から町を守る事を最優先に行動する。
ちょうどそこへSoniaが町を訪れ、\eimp二人で
協力して町の魔物達を討伐\ec[0]する事になった。
"],

               "09-02b" => ["第九章", "09", 
"魔物を倒していると町の一角でLunariaの母
Eleanorが戦っている所に遭遇する。しかし
Lunariaの目の前でEleanorは無情にも魔物達に
連れ去られてしまう。
悲しむ間もなく襲い来る魔物を倒すLunaria。

城下町の魔物を粗方片づけた二人はお城へ救援に
向かう。しかしそこで見た光景は魔物に
連れ去られるShirleyとEstiaの姿だった。

首謀者と思われる淫魔は二人を転移させた後
『人質』という言葉を残しその場を去った…
"],

               "09-03" => ["第九章", "09", 
"MillayやDianaに塔での経緯を報告していると
黒ローブの男から通信が入る。攫った人質を
解放して欲しければ宝玉を持って
西の地下遺跡へ来い――と。

その男の声を聞いてSoniaは絶句する。
男の正体は\eimpSoniaの夫
Wright・サンディール\ec[0]だったのだ。
しかしそれはWright本人ではなく、Wrightの
身体に憑依した何者かの意思だという。
攫った人々だけでなくSoniaの夫までも人質に
とられたLunariaは、男の取引に応じる事に…

こうしてLunariaはSoniaと共に
\eimp西の地下遺跡\ec[0]へと向かう事になった。
"],

               "09-04" => ["第九章", "09", 
"地下遺跡の最下層で黒ローブの男と対峙する
Lunaria達。人質の解放を条件に宝玉を男に渡すと
邪石を通した宝玉の魔力が男に流入――気付くと
そこには\eimp古の魔神Beelzelian\ec[0]が復活していた。

魔神は\eimpDianaとMillayを拘束すると
そのまま二人を浮遊大陸へと連れ去った\ec[0]。

その後 救出した人質を連れ城へと戻り
Marianaや大臣らに現状を報告。連れ去られた
Diana達を救出する作戦を話し合うがいい案は
浮かばず一旦解散する。

Soniaとその夫の容態が気になったLunariaは
\eimp医務室\ec[0]へと向かった。
"],

               "09-05" => ["第九章", "09", 
"Soniaと夫のWrightはダリア王国が面倒を
見てくれる事となった。Sonia達に別れを告げ
会議室へ戻るとMarianaと\esbt[31]から
魔神のいる浮遊大陸へ行く方法を教えられる。
浮遊大陸へは\eimp城の地下にある魔法陣\ec[0]を起動
させなければならず、それには\eimpトキワとダリア
それぞれの神器\ec[0]が必要だという。

ダリアの神器は既にFilicaに手配済みだが
トキワとは連絡がつかないという…

Lunariaはトキワの神器を借り受けるため
\eimpグレア洞窟を抜け港町セネシオを目指す\ec[0]事に
"],

               "10-01" => ["第十章", "10", 
"トキワへ渡るため港町セネシオを目指すLunaria。
一方、浮遊大陸 魔神城では魔神が
\eimp淫魔の女王Asmolios\ec[0]を復活させていた。

復活した淫魔の女王はBeelzelianに
忠誠を誓う。そして人を殺さずダリア王国を
陥落させて見せると言い、配下のRennoを連れ
王都カクタスへと飛び立っていった…
"],

               "10-02" => ["第十章", "10", 
"グレア洞窟を無事に抜けたLunaria。
その頃 浮遊大陸では\eimpDianaとMillayが
淫堕の洗脳鬼Zeparの術に落ち
洗脳鬼の忠実な肉奴隷\ec[0]へと堕とされていた。

一方、港町へと到着したLunariaは
トキワへの船が出ていないことを聞かされるが
以前Manaが使っていた転送陣を思い出す。

それを使い無事トキワ近くの小島への上陸を
果たした。後はこのまま\eimpトキワへ続く地下道\ec[0]を
進むだけだ。
"],

               "10-03" => ["第十章", "10", 
"トキワへの地下道を進んでいると、途中で
Manaと遭遇する。なんとトキワが妖怪軍団に襲われ
九条の里も陥落寸前だという。

サジタリーズの救援が絶望的だと知ったManaは
Lunariaの助力を得、そのまま\eimp九条の里\ec[0]へと
急いで戻るのだった。
"],

               "11-01" => ["第十一章", "11", 
"Lunaria達が地下道を進んでいる頃、九条の里は
復活した\eimp邪龍Magatsuorochi\ec[0]に襲われ
全ての巫女は敗北。

巫女の長である\eimpTsukihaと側近の\esbt[14]は
邪龍に攫われて\ec[0]しまった…
"],

               "11-02" => ["第十一章", "11", 
"里へと到着したMana達が見た物、それは
妖怪に蹂躙される里の悲惨な現状だった。

妖怪への怒りから法術の奥義を放ち
敵を全滅させるMana。しかしその直後
術の影響で倒れてしまう。

無事だった巫女からTsukiha達が攫われた事を
知ったManaとLunariaは彼女達を救出する為
邪龍の待つ\eimp北の洞窟の最奥 封印の地\ec[0]を
目指すのだった。
"],

               "11-03" => ["第十一章", "11", 
"洞窟の途中で捕まった他の巫女達が妖怪の苗床に
されている現場に遭遇した二人は
その妖怪達を倒し彼女達を救出する。

妖怪達は既に多くの子供を巫女達に産ませ
自分達の戦力としているようだ。

おそらく邪龍も既に繁殖を開始しているだろう…
手遅れになる前に洞窟の最奥へ行き
邪龍を倒さなければならない。
"],

               "11-04" => ["第十一章", "11", 
"LunariaとManaは力を合わせ
封印の地で邪龍を倒す事に成功する。
その際ManaはLunariaの中に不思議な力が
ある事を感じ取る。あれは一体なんだったのか…

邪龍を倒した翌朝、Lunariaは
Manaと合流すると本来の目的であった
神器を借り受けるため\eimpTsukihaの屋敷\ec[0]へと
足を運ぶのだった。
"],

               "11-05" => ["第十一章", "11", 
"Tsukihaから無事トキワの神器を借り受けた
Lunaria。そして今回の女王救出に\eimpManaも
同行\ec[0]してくれるという。

心強い仲間を加えたLunariaのもとにMarianaから
通信が入る。ダリアからの神器が届かないので
様子を見てきて欲しい、と。

ダリアへは\eimpラグラス西のティモル山\ec[0]を越える
必要がある。二人は準備が出来次第、
\eimpダリア王国を目指す\ec[0]事となった。
"],

               "12-01" => ["第十二章", "12", 
"Lunaria一行がダリアを目指している頃
ダリア王国は淫魔の軍勢の襲撃を受けていた。

Filicaや王国騎士団は必死に応戦したが
淫魔の女王が現れた事で戦況は一変する。

ダリア最強であった\eimp騎士王Filicaは
淫魔の女王に敗れて\ec[0]しまう。
これにより騎士団は戦意を喪失、
これからダリア王都は、淫魔達が支配する
\eimp淫靡と快楽の都\ec[0]へと姿を変える…
"],

               "12-02" => ["第十二章", "12", 
"国境の関所へ行くとそこにダリアの兵士の姿は
なかった。不信に思った二人はネメシアへ
立ち寄ると、ダリアの王都が淫魔の軍勢により
陥落している事を聞かされる。

王都を淫魔の魔手から解放する為
Lunaria達は\eimpハイドラ湿原\ec[0]を越え
ダリア王都を目指す。
"],

               "12-03" => ["第十二章", "12", 
"王都内は聞いていた通り淫魔達の跋扈する
淫靡と快楽の都へと変貌していた。

Manaの話では強力な気を放つ者が城に
いるらしい。恐らくそれが淫魔のボスだろう。

淫魔のボスを倒し王都を解放する為
二人は\eimp王都を抜けダリア城を目指す\ec[0]事に。
"],

               "12-04" => ["第十二章", "12", 
"王都の途中でSoniaと男達がセックスを
しているところを目撃した二人は淫魔を倒し
Sonia達を術で解放する。

王都解放のメンバーにSoniaも加わり
三人は再び城を目指し進み始めた。
"],

               "12-05" => ["第十二章", "12", 
"城内にはさらに強力な魔物が蔓延っている。

淫魔のボスと思しき者がいる場所はどうやら
\eimp三階の謁見の間\ec[0]のようだ。
"],

               "12-06" => ["第十二章", "12", 
"謁見の間にいた淫魔Rennoを倒し
無事王都を解放する事に成功したLunaria達。

Filicaからダリアの神器を借り受け
\eimpSoniaも正式にパーティに加わる\ec[0]事になった。

２つの神器を揃えた一行はMarianaに
報告する為、\eimpサジタリーズへ戻る\ec[0]事に。
"],

               "13-01" => ["第十三章", "13", 
"無事に２つの神器を集めサジタリーズへ
帰還した三人は、\eimp城の会議室\ec[0]にいる
Marianaのもとへ急いだ。
"],

               "13-02" => ["第十三章", "13", 
"浮遊大陸への魔法陣がある地下へ下りた
Lunaria、Mana、Sonia、そしてMariana。

王家の者しか開ける事の出来ない扉を前に
\eimpMarianaは自分が王家の血を引く
Dianaの腹違いの姉妹\ec[0]であることを告げ
魔法陣へ続く扉を開ける。

神器を祭壇に捧げ、魔法陣の起動に成功した
Lunaria達は\eimp浮遊大陸\ec[0]へと旅立つ。

――妹であるDianaの事を
Marianaに託されて…
"],

               "13-03" => ["第十三章", "13", 
"浮遊大陸を進むと、魔神の居城ではない
怪しげな砦が行く手を遮る。

砦内は巧妙な罠が仕掛けられており
落とし穴の罠にかかってしまったSoniaは
Lunaria達と分断されてしまう。

Soniaが落ちた先には淫堕の洗脳鬼が
待ち構えており、\eimpSoniaはネメシアの時同様
Zeparの洗脳術\ec[0]にかかってしまう。
"],

               "13-04" => ["第十三章", "13", 
"Soniaを探して砦を探索していたLunaria達の
前に洗脳されたDiana、Millay、そして
Soniaが立ち塞がる。

三人をなんとか退け浄化の術を施すも
解除できたのはSoniaだけだった。
その後洗脳鬼を倒すもトドメをDianaに
阻まれ取り逃がしてしまう。
すぐに後を追うが、そこで見たのは\eimp魔神により
屠られた洗脳鬼\ec[0]と、\eimp魔神の洗脳下におかれた
DianaとMillay\ec[0]の二人だった。

――\eimp魔神城の玉座にて待つ\ec[0]――
魔神はそう言い残すと再び二人を連れ去り
闇へと消えて行った…
"],

               "14-01" => ["最終章", "14", 
"砦を出ると北の方角に魔神城が見て取れた。

三人は決意を胸に魔神城への道を歩き始めた…
"],

#＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃#
               "14-02" => ["最終章", "14", 
"魔神城へ到着したLunaria達。
城からは禍々しい気配が満ちており
その異様さに圧倒される。

三人は決意を新たにし、\eimp魔神のいる玉座\ec[0]を目指し
城へと足を踏み入れた。
"],

               "14-03" => ["最終章", "14", 
"魔神のいる最上階を目指して城を上がっていくと
途中 邪悪な気配に満ちた部屋へと到着する。

そこにはFilicaを倒し王都カクタスを淫都へと
変えた淫魔の女王Asmoliosの姿があった。

Rennoを倒した事により復讐に燃えるAsmolios。
真の姿を現した彼女と対決し辛くも勝利するも
淫魔の女王は消滅を免れようとLunariaの中に
眠る淫魔石を介して身体を乗っ取ろうと画策し
Lunariaへと襲い掛かった…
"],

               "14-04" => ["最終章", "14", 
"Lunariaの身体を乗っ取ろうとしたAsmolios
だったが、その時Lunariaを不思議な力が守り
淫魔の女王を身体の外へと弾き飛ばし、
それと同時に淫魔石が砕け散る。

身体を奪う事に失敗した淫魔の女王は断末魔の
叫びと共にそのまま消滅…

自分の中に眠る不思議な力を疑問に思いつつも
LunariaはDianaとMillayを救出する為
仲間と共に魔神のいる玉座を目指し
再び城を上がっていった…
"],

  ]
  
end
# 最大１５行 ２３文字