#==============================================================================
# ■ Game_System
#------------------------------------------------------------------------------
# 　システム周りのデータを扱うクラスです。セーブやメニューの禁止状態などを保存
# します。このクラスのインスタンスは $game_system で参照されます。
#==============================================================================

class Game_System
  #--------------------------------------------------------------------------
  # ● 定数（特徴）
  #--------------------------------------------------------------------------
  TRUE_ROUTE  = 20              # トゥルールート判定スイッチ
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  alias chapter_initialize initialize
  def initialize
    chapter_initialize
    chapter_reset
  end
=begin
  attr_accessor :route              # 現在のルート
  #--------------------------------------------------------------------------
  #  ○ ルート変更
  #--------------------------------------------------------------------------
  def route_change(symbol)
    @route = symbol
  end
=end
  #--------------------------------------------------------------------------
  #  ○ ※周回テストデータの調整用
  #--------------------------------------------------------------------------
  def chapter_delete
    p @chapter_title
    10.times{|i| @chapter_title.shift }
    p @chapter_title
  end
  #--------------------------------------------------------------------------
  #  ○ チャプターリセット
  #--------------------------------------------------------------------------
  def chapter_reset
    @chapter_title = []
  end
  #--------------------------------------------------------------------------
  #  ○ チャプター進行
  #--------------------------------------------------------------------------
  def next_chapter
    @chapter_title.push(Chapter.chapter_id($game_variables[Chapter::CHAPTER_NUMBER]))
  end
  #--------------------------------------------------------------------------
  #  ○ 現在のチャプタータイトル
  #--------------------------------------------------------------------------
  def now_chapter
    chapter_name($game_variables[Chapter::CHAPTER_NUMBER])
  end
  #--------------------------------------------------------------------------
  #  ○ チャプター名の取得
  #--------------------------------------------------------------------------
  def chapter_name(num)
    Chapter.chapter_name(@chapter_title[num])
  end
  #--------------------------------------------------------------------------
  #  ○ トゥルールートか
  #--------------------------------------------------------------------------
  def true_route?
    $game_switches[TRUE_ROUTE]
    #@route == :true
  end
  #--------------------------------------------------------------------------
  #  ○ トゥルールートの条件チェック
  #--------------------------------------------------------------------------
  def true_check
    $game_actors[1].virgin && $game_variables[FAKEREAL::SEX_POINT] == 0 && $game_actors[1].sex_all_count == 0
  end
  #--------------------------------------------------------------------------
  #  ○ 塔にてトゥルールートに入るかチェック
  #--------------------------------------------------------------------------
  def tower_check
    true_check && $game_switches[212] && $game_switches[213]
  end
end

module Chapter
  #--------------------------------------------------------------------------
  # 〇 定数
  #--------------------------------------------------------------------------
  CHAPTER_NUMBER  = 22              # チャプター管理変数
  BEFORE_TR  = 19               # トゥルールート事前確定スイッチ
  #--------------------------------------------------------------------------
  #  ○ チャプター名
  #--------------------------------------------------------------------------
  def self.chapter_name(id)
    case id
    when "00"  ; "序章　魔法王国と宮廷魔術師"
    when "01"  ; "第一章　森の奥の遺跡"
    when "02"  ; "第二章　出会い"
    when "03"  ; "第三章　氷の神殿"
    when "04"  ; "第四章　巫女の住む里"
    when "05"  ; "第五章　ダリア王国へ"
    when "06a" ; "第六章　暗躍する影"
    when "06b" ; "第六章　黒き陰謀と大富豪"
    when "07"  ; "第七章　淫堕の宗教"
    when "08"  ; "第八章　最後の宝玉 そして…"
    when "09a" ; "第九章　サジタリーズ襲撃！"
    when "09b" ; "最終章　サジタリーズの宮廷魔術師"
    when "10"  ; "第十章　復活する古の魔物達"
    when "11"  ; "第十一章　邪龍"
    when "12"  ; "第十二章　淫靡と快楽の都"
    when "13"  ; "第十三章　洗脳鬼の罠"
    when "14"  ; "最終章　受け継がれし魔力-ちから-"
    else       ; ""
    end
  end
  #--------------------------------------------------------------------------
  #  ○ チャプター名
  #--------------------------------------------------------------------------
  def self.chapter_id(num)
    case num
    when 0  ; "00"
    when 1  ; "01"
    when 2  ; "02"
    when 3  ; "03"
    when 4  ; "04"
    when 5  ; "05"
    when 6 
      if $game_system.true_check
        "06a"
      else
        "06b"
      end
    when 7  ; "07"
    when 8  ; "08"
    when 9
      if $game_switches[BEFORE_TR]
        "09a"
      else
        "09b"
      end
    when 10  ; "10"
    when 11  ; "11"
    when 12  ; "12"
    when 13  ; "13"
    when 14  ; "14"
    else       ; ""
    end
  end
end

#==============================================================================
# ■ Game_Interpreter
#------------------------------------------------------------------------------
# 　イベントコマンドを実行するインタプリタです。このクラスは Game_Map クラス、
# Game_Troop クラス、Game_Event クラスの内部で使用されます。
#==============================================================================

class Game_Interpreter
  #--------------------------------------------------------------------------
  #  ○ チャプター進行
  #--------------------------------------------------------------------------
  def next_chapter
    $game_system.next_chapter
  end
  #--------------------------------------------------------------------------
  #  ○ チャプター進行
  #--------------------------------------------------------------------------
  def chapter_reset
    $game_system.chapter_reset
  end
end