#==============================================================================
# ■ Game_Battler
#------------------------------------------------------------------------------
# 　スプライトや行動に関するメソッドを追加したバトラーのクラスです。このクラス
# は Game_Actor クラスと Game_Enemy クラスのスーパークラスとして使用されます。
#==============================================================================

class Game_Battler < Game_BattlerBase
  #--------------------------------------------------------------------------
  # ● 定数（使用効果）
  #--------------------------------------------------------------------------
  CHARM_SKILL     = 545              # 蠱惑の色香
  #--------------------------------------------------------------------------
  # ● 使用効果［ステート付加］
  #--------------------------------------------------------------------------
  alias charm_item_effect_add_state item_effect_add_state
  def item_effect_add_state(user, item, effect)
    if effect.data_id == 51 && user.actor? && user.skill_learn?($data_skills[CHARM_SKILL])
      item_effect_add_state_attack(user, item, effect)
    else
      charm_item_effect_add_state(user, item, effect)
    end
  end
end