#==============================================================================
# ■ Game_Interpreter
#------------------------------------------------------------------------------
# 　イベントコマンドを実行するインタプリタです。このクラスは Game_Map クラス、
# Game_Troop クラス、Game_Event クラスの内部で使用されます。
#==============================================================================

class Game_Interpreter
  #--------------------------------------------------------------------------
  # 〇 イベントが特定位置に来るまでウェイト
  #--------------------------------------------------------------------------
  def event_wait(x, y, id = 0)
    character = get_character(id)
    until (character.x == x && character.y == y)
      wait(15)
    end
  end
end