#==============================================================================
# ■ Window_ActorCommand
#------------------------------------------------------------------------------
# 　バトル画面で、アクターの行動を選択するウィンドウです。
#==============================================================================

class Window_ActorCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● 防御コマンドをリストに追加　※エイリアス　防御スキルが封印されている場合
  #     防御コマンドが表記されない。
  #--------------------------------------------------------------------------
  alias no_guard_add_guard_command add_guard_command
  def add_guard_command
    no_guard_add_guard_command if @actor.guard_usable?
  end
end